network_basics/proj-week/20221152xxx.tex
% Created 2023-07-07 Fri 15:12
% Intended LaTeX compiler: pdflatex
\documentclass{wx672ctexart} \usepackage{hyperref}
\usepackage{amsmath,amsfonts,amssymb}
\usepackage{graphicx}
\usepackage{tabularray}
\usepackage{minted}
\usepackage[margin=2cm]{geometry}
\usepackage{wx672minted}
\pagestyle{plain}
\author{张三 (20221159xxx)}
\date{\today}
\title{课程实习报告（2022-2023-02）}
\hypersetup{
 pdfauthor={张三 (20221159xxx)},
 pdftitle={课程实习报告（2022-2023-02）},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.2 (Org mode 9.5.5)}, 
 pdflang={Cn}}
\begin{document}

\maketitle
\tableofcontents


\section{Packet analysis}
\label{sec:orgdfaf11c}
Upon running the following command:

\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
sudo tcpdump -ilo -nnvvvxXKS -s0 port 3333
\end{minted}

the following packet is captured:

\begin{verbatim}
08:34:10.790666 IP (tos 0x0, ttl 64, id 12824, offset 0, flags [DF], proto TCP (6),
length 64)
    127.0.0.1.46668 > 127.0.0.1.3333: Flags [P.], seq 2400005725:2400005737, ack 373279396,
    win 512, options [nop,nop,TS val 3259949783 ecr 3259896343], length 12
        0x0000:  4500 0040 3218 4000 4006 0a9e 7f00 0001  E..@2.@.@.......
        0x0010:  7f00 0001 b64c 0d05 8f0d 2e5d 163f caa4  .....L.....].?..
        0x0020:  8018 0200 fe34 0000 0101 080a c24e e2d7  .....4.......N..
        0x0030:  c24e 1217 6865 6c6c 6f20 776f 726c 640a  .N..hello.world.
\end{verbatim}

\begin{enumerate}
\item Tell me the meaning of each option used in the previous command.
\begin{itemize}
\item \textbf{-i}:
\item \textbf{-nn}:
\item \textbf{-vvv}:
\item \textbf{-x}:
\item \textbf{-X}:
\item \textbf{-S}:
\item \textbf{-K}:
\item \textbf{-s0}:
\end{itemize}

\item Please analyze this captured packet and explain it to me as detailed as you can.     
\begin{description}
\item[{Answer}] 
\end{description}
\end{enumerate}

\section{HTTP}
\label{sec:org7adcbc1}
\begin{enumerate}
\item Write a simple script showing how HTTP works (you need \texttt{curl});
\begin{minted}[mathescape=true,linenos=true,numbersep=5pt,frame=lines,framesep=2mm]{sh}
#!/bin/bash

\end{minted}

\item Record your HTTP demo session with \texttt{ttyrec}.
\end{enumerate}

\section{Questions}
\label{sec:org1ca3828}
List at least 5 problems you've met while doing this work. When listing your problems,
you have to tell me:
\begin{enumerate}
\item Description of this problem. For example,
\begin{itemize}
\item What were you trying to do before seeing this problem?
\end{itemize}
\item How did you try solving this problem？ For example,
\begin{itemize}
\item Did you google? web links?
\item Did you read the man page?
\item Did you ask others for hints?
\end{itemize}
\end{enumerate}

\subsection{Problems}
\label{sec:org7e2d169}
\begin{enumerate}
\item 

\item 

\item 

\item 

\item 
\end{enumerate}
\end{document}
%%% Local Variables:
%%% mode: latex
%%% TeX-master: t
%%% End:
